IDEA Open Model
Element2D.ElementType Property
Compatible with IDEA StatiCa Beta 20.0
 Analysis type - shell, plate, wall
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public Element2DType ElementType { get; set; }
Public Property ElementType As Element2DType
	Get
	Set
Property Value
Type: Element2DType
See Also
Reference
Element2D Class
IdeaRS.OpenModel.Model Namespace